; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image1 - mode
	infrared2 - mode
	spectrograph0 - mode
	Star0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation2 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 114)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet8)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 142)
	(= (data Planet4 image1) 83)
	(= (data Phenomenon5 image1) 56)
	(= (data Star6 image1) 12)
	(= (data Planet7 image1) 71)
	(= (data Planet8 image1) 26)
	(= (data Phenomenon9 image1) 190)
	(= (data Phenomenon10 image1) 100)
	(= (data Planet4 infrared2) 144)
	(= (data Phenomenon5 infrared2) 144)
	(= (data Star6 infrared2) 97)
	(= (data Planet7 infrared2) 143)
	(= (data Planet8 infrared2) 264)
	(= (data Phenomenon9 infrared2) 271)
	(= (data Phenomenon10 infrared2) 178)
	(= (data Planet4 spectrograph0) 12)
	(= (data Phenomenon5 spectrograph0) 36)
	(= (data Star6 spectrograph0) 296)
	(= (data Planet7 spectrograph0) 83)
	(= (data Planet8 spectrograph0) 240)
	(= (data Phenomenon9 spectrograph0) 13)
	(= (data Phenomenon10 spectrograph0) 215)
	(= (slew_time Star1 Star0) 23.59)
	(= (slew_time Star0 Star1) 23.59)
	(= (slew_time Star3 Star0) 72.14)
	(= (slew_time Star0 Star3) 72.14)
	(= (slew_time Star3 Star1) 3.798)
	(= (slew_time Star1 Star3) 3.798)
	(= (slew_time Star3 GroundStation2) 46.45)
	(= (slew_time GroundStation2 Star3) 46.45)
	(= (slew_time GroundStation2 Star0) 50.02)
	(= (slew_time Star0 GroundStation2) 50.02)
	(= (slew_time GroundStation2 Star1) 38.94)
	(= (slew_time Star1 GroundStation2) 38.94)
	(= (slew_time Planet4 Star0) 29.93)
	(= (slew_time Star0 Planet4) 29.93)
	(= (slew_time Planet4 Star1) 62.82)
	(= (slew_time Star1 Planet4) 62.82)
	(= (slew_time Planet4 GroundStation2) 20.6)
	(= (slew_time GroundStation2 Planet4) 20.6)
	(= (slew_time Planet4 Star3) 5.506)
	(= (slew_time Star3 Planet4) 5.506)
	(= (slew_time Phenomenon5 Star0) 29.3)
	(= (slew_time Star0 Phenomenon5) 29.3)
	(= (slew_time Phenomenon5 Star1) 63.04)
	(= (slew_time Star1 Phenomenon5) 63.04)
	(= (slew_time Phenomenon5 GroundStation2) 46.56)
	(= (slew_time GroundStation2 Phenomenon5) 46.56)
	(= (slew_time Phenomenon5 Star3) 7.207)
	(= (slew_time Star3 Phenomenon5) 7.207)
	(= (slew_time Phenomenon5 Planet4) 51.79)
	(= (slew_time Planet4 Phenomenon5) 51.79)
	(= (slew_time Star6 Star0) 30.44)
	(= (slew_time Star0 Star6) 30.44)
	(= (slew_time Star6 Star1) 12.75)
	(= (slew_time Star1 Star6) 12.75)
	(= (slew_time Star6 GroundStation2) 40.38)
	(= (slew_time GroundStation2 Star6) 40.38)
	(= (slew_time Star6 Star3) 21.61)
	(= (slew_time Star3 Star6) 21.61)
	(= (slew_time Star6 Planet4) 20.3)
	(= (slew_time Planet4 Star6) 20.3)
	(= (slew_time Star6 Phenomenon5) 52.05)
	(= (slew_time Phenomenon5 Star6) 52.05)
	(= (slew_time Planet7 Star0) 8.251)
	(= (slew_time Star0 Planet7) 8.251)
	(= (slew_time Planet7 Star1) 86.82)
	(= (slew_time Star1 Planet7) 86.82)
	(= (slew_time Planet7 GroundStation2) 14.09)
	(= (slew_time GroundStation2 Planet7) 14.09)
	(= (slew_time Planet7 Star3) 8.036)
	(= (slew_time Star3 Planet7) 8.036)
	(= (slew_time Planet7 Planet4) 37.46)
	(= (slew_time Planet4 Planet7) 37.46)
	(= (slew_time Planet7 Phenomenon5) 4.315)
	(= (slew_time Phenomenon5 Planet7) 4.315)
	(= (slew_time Planet7 Star6) 15.67)
	(= (slew_time Star6 Planet7) 15.67)
	(= (slew_time Planet8 Star0) 68.07)
	(= (slew_time Star0 Planet8) 68.07)
	(= (slew_time Planet8 Star1) 42.76)
	(= (slew_time Star1 Planet8) 42.76)
	(= (slew_time Planet8 GroundStation2) 18.18)
	(= (slew_time GroundStation2 Planet8) 18.18)
	(= (slew_time Planet8 Star3) 48.8)
	(= (slew_time Star3 Planet8) 48.8)
	(= (slew_time Planet8 Planet4) 40.24)
	(= (slew_time Planet4 Planet8) 40.24)
	(= (slew_time Planet8 Phenomenon5) 31.79)
	(= (slew_time Phenomenon5 Planet8) 31.79)
	(= (slew_time Planet8 Star6) 2.826)
	(= (slew_time Star6 Planet8) 2.826)
	(= (slew_time Planet8 Planet7) 66.64)
	(= (slew_time Planet7 Planet8) 66.64)
	(= (slew_time Phenomenon9 Star0) 83.48)
	(= (slew_time Star0 Phenomenon9) 83.48)
	(= (slew_time Phenomenon9 Star1) 26.54)
	(= (slew_time Star1 Phenomenon9) 26.54)
	(= (slew_time Phenomenon9 GroundStation2) 9.184)
	(= (slew_time GroundStation2 Phenomenon9) 9.184)
	(= (slew_time Phenomenon9 Star3) 31.32)
	(= (slew_time Star3 Phenomenon9) 31.32)
	(= (slew_time Phenomenon9 Planet4) 62.37)
	(= (slew_time Planet4 Phenomenon9) 62.37)
	(= (slew_time Phenomenon9 Phenomenon5) 20.04)
	(= (slew_time Phenomenon5 Phenomenon9) 20.04)
	(= (slew_time Phenomenon9 Star6) 37.27)
	(= (slew_time Star6 Phenomenon9) 37.27)
	(= (slew_time Phenomenon9 Planet7) 53.4)
	(= (slew_time Planet7 Phenomenon9) 53.4)
	(= (slew_time Phenomenon9 Planet8) 11.37)
	(= (slew_time Planet8 Phenomenon9) 11.37)
	(= (slew_time Phenomenon10 Star0) 8.383)
	(= (slew_time Star0 Phenomenon10) 8.383)
	(= (slew_time Phenomenon10 Star1) 24.4)
	(= (slew_time Star1 Phenomenon10) 24.4)
	(= (slew_time Phenomenon10 GroundStation2) 56.6)
	(= (slew_time GroundStation2 Phenomenon10) 56.6)
	(= (slew_time Phenomenon10 Star3) 63.31)
	(= (slew_time Star3 Phenomenon10) 63.31)
	(= (slew_time Phenomenon10 Planet4) 3.17)
	(= (slew_time Planet4 Phenomenon10) 3.17)
	(= (slew_time Phenomenon10 Phenomenon5) 12.14)
	(= (slew_time Phenomenon5 Phenomenon10) 12.14)
	(= (slew_time Phenomenon10 Star6) 50.23)
	(= (slew_time Star6 Phenomenon10) 50.23)
	(= (slew_time Phenomenon10 Planet7) 4.01)
	(= (slew_time Planet7 Phenomenon10) 4.01)
	(= (slew_time Phenomenon10 Planet8) 70.69)
	(= (slew_time Planet8 Phenomenon10) 70.69)
	(= (slew_time Phenomenon10 Phenomenon9) 42.48)
	(= (slew_time Phenomenon9 Phenomenon10) 42.48)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 GroundStation2)
	(have_image Planet4 image1)
	(have_image Phenomenon5 image1)
	(have_image Planet7 image1)
	(have_image Phenomenon9 spectrograph0)
	(have_image Phenomenon10 spectrograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 phenomenon10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon10)
   changed: (fuel satellite1) from 142 to 71.31, (fuel-used) from 0 to 70.69
   goals met: 0 of 6
2. (turn_to satellite0 groundstation2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 114 to 73.62, (fuel-used) from 70.69 to 111.07
   goals met: 1 of 6
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 6
4. (turn_to satellite1 planet7 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 71.31 to 67.3, (fuel-used) from 111.07 to 115.08
   goals met: 1 of 6
5. (turn_to satellite1 groundstation2 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 67.3 to 53.21, (fuel-used) from 115.08 to 129.17
   goals met: 1 of 6
6. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 6
7. (turn_to satellite1 planet7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 53.21 to 39.12, (fuel-used) from 129.17 to 143.26
   goals met: 1 of 6
8. (take_image satellite1 planet7 instrument1 image1)
   added: (have_image planet7 image1)
   changed: (data_capacity satellite1) from 1000 to 929, (data-stored) from 0 to 71
   goals met: 2 of 6
9. (turn_to satellite1 phenomenon10 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon10)
   changed: (fuel satellite1) from 39.12 to 35.11, (fuel-used) from 143.26 to 147.27
   goals met: 2 of 6
10. (turn_to satellite1 planet4 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet4)
   changed: (fuel satellite1) from 35.11 to 31.94, (fuel-used) from 147.27 to 150.44
   goals met: 2 of 6
11. (take_image satellite1 planet4 instrument1 image1)
   added: (have_image planet4 image1)
   changed: (data_capacity satellite1) from 929 to 846, (data-stored) from 71 to 154
   goals met: 3 of 6
12. (turn_to satellite1 phenomenon10 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 phenomenon10)
   changed: (fuel satellite1) from 31.94 to 28.77, (fuel-used) from 150.44 to 153.61
   goals met: 3 of 6
13. (take_image satellite1 phenomenon10 instrument1 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   changed: (data_capacity satellite1) from 846 to 631, (data-stored) from 154 to 369
   goals met: 4 of 6
14. (turn_to satellite1 planet7 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet7)
   changed: (fuel satellite1) from 28.77 to 24.76, (fuel-used) from 153.61 to 157.62
   goals met: 4 of 6
15. (turn_to satellite1 phenomenon5 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 24.76 to 20.445, (fuel-used) from 157.62 to 161.935
   goals met: 4 of 6
16. (take_image satellite1 phenomenon5 instrument1 image1)
   added: (have_image phenomenon5 image1)
   changed: (data_capacity satellite1) from 631 to 575, (data-stored) from 369 to 425
   goals met: 5 of 6
17. (turn_to satellite1 phenomenon9 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 20.445 to 0.405, (fuel-used) from 161.935 to 181.975
   goals met: 5 of 6
18. (take_image satellite1 phenomenon9 instrument1 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   changed: (data_capacity satellite1) from 575 to 562, (data-stored) from 425 to 438
   goals met: 6 of 6
